
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * module.ccpay-feeregister-api-core.azurerm_api_management_api.api
  * module.ccpay-feeregister-api-core.azurerm_api_management_product_api.link_to_product[0]
  * module.ccpay-feeregister-policy-core.azurerm_api_management_api_policy.api_policy
  * module.ccpay-feeregister-product-core.azurerm_api_management_product.product
  * module.ccpay-feeregister-product-core.azurerm_api_management_product_group.access_control_groups[&#34;developers&#34;]
* Delete
  * azurerm_key_vault_secret.appinsights_instrumentation_key
  * azurerm_key_vault_secret.freg-idam-client-secret
  * azurerm_key_vault_secret.freg-idam-generated-user-email-pattern
  * azurerm_key_vault_secret.freg-idam-test-user-password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.appinsights_instrumentation_key will be destroyed
  - resource "azurerm_key_vault_secret" "appinsights_instrumentation_key" {
      - content_type   = "" -> null
      - id             = "https://fees-register-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey/46ae73f08f13483397fdd8f4b14e7070" -> null
      - key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/fees-register-aat" -> null
      - name           = "AppInsightsInstrumentationKey" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "46ae73f08f13483397fdd8f4b14e7070" -> null
      - versionless_id = "https://fees-register-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey" -> null

      - timeouts {}
    }

  # azurerm_key_vault_secret.freg-idam-client-secret will be destroyed
  - resource "azurerm_key_vault_secret" "freg-idam-client-secret" {
      - content_type   = "" -> null
      - id             = "https://fees-register-aat.vault.azure.net/secrets/freg-idam-client-secret/ca999ab321bb4a5589c111dbf8208847" -> null
      - key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/fees-register-aat" -> null
      - name           = "freg-idam-client-secret" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "ca999ab321bb4a5589c111dbf8208847" -> null
      - versionless_id = "https://fees-register-aat.vault.azure.net/secrets/freg-idam-client-secret" -> null

      - timeouts {}
    }

  # azurerm_key_vault_secret.freg-idam-generated-user-email-pattern will be destroyed
  - resource "azurerm_key_vault_secret" "freg-idam-generated-user-email-pattern" {
      - content_type   = "" -> null
      - id             = "https://fees-register-aat.vault.azure.net/secrets/freg-idam-generated-user-email-pattern/a411c990fd0a48de816015a2c92b2840" -> null
      - key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/fees-register-aat" -> null
      - name           = "freg-idam-generated-user-email-pattern" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "a411c990fd0a48de816015a2c92b2840" -> null
      - versionless_id = "https://fees-register-aat.vault.azure.net/secrets/freg-idam-generated-user-email-pattern" -> null

      - timeouts {}
    }

  # azurerm_key_vault_secret.freg-idam-test-user-password will be destroyed
  - resource "azurerm_key_vault_secret" "freg-idam-test-user-password" {
      - content_type   = "" -> null
      - id             = "https://fees-register-aat.vault.azure.net/secrets/freg-idam-test-user-password/95f36bffb3764d8ba04fd48c52699466" -> null
      - key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ccpay-aat/providers/Microsoft.KeyVault/vaults/fees-register-aat" -> null
      - name           = "freg-idam-test-user-password" -> null
      - tags           = {} -> null
      - value          = (sensitive value)
      - version        = "95f36bffb3764d8ba04fd48c52699466" -> null
      - versionless_id = "https://fees-register-aat.vault.azure.net/secrets/freg-idam-test-user-password" -> null

      - timeouts {}
    }

  # module.ccpay-feeregister-api-core.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "core-api-mgmt-aat"
      + display_name          = "Fee Register API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "feeregister-apiList"
      + path                  = "feeRegister-api"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "core-infra-aat"
      + revision              = "1"
      + service_url           = "http://fees-register-api-aat.service.core-compute-aat.internal"
      + soap_pass_through     = false
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-link-json"
          + content_value  = "https://raw.githubusercontent.com/hmcts/reform-api-docs/master/docs/specs/ccpay-payment-app.freg_api1.json"
        }

      + subscription_key_parameter_names {
          + header = (known after apply)
          + query  = (known after apply)
        }
    }

  # module.ccpay-feeregister-api-core.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "core-api-mgmt-aat"
      + api_name            = "feeregister-apiList"
      + id                  = (known after apply)
      + product_id          = "feeRegister"
      + resource_group_name = "core-infra-aat"
    }

  # module.ccpay-feeregister-policy-core.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "core-api-mgmt-aat"
      + api_name            = "feeregister-apiList"
      + id                  = (known after apply)
      + resource_group_name = "core-infra-aat"
      + xml_content         = <<-EOT
            <policies>
              <backend>
                <base/>
              </backend>
              <inbound>
                <base/>
                <choose>
                  <when condition="@(context.Request.Certificate == null || context.Request.Certificate.NotAfter < DateTime.Now || context.Request.Certificate.NotBefore > DateTime.Now || !(new string[] {&quot;B1BF8007527F85085D7C4A3DC406A9A6D124D721&quot;,&quot;E5F54E7BA2B780E2B1B1FFAC68F801251935BE80&quot;,&quot;B9D9E70AC23EAF8EA094F6B59EF77FF77D977CBE&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
                    <return-response>
                      <set-status code="403" reason="Invalid client certificate. Please check expiry."/>
                    </return-response>
                  </when>
                </choose>
                <!-- generate totp -->
              </inbound>
              <outbound>
                <base/>
            </outbound>
              <on-error>
                <base/>
              </on-error>
            </policies>
        EOT
    }

  # module.ccpay-feeregister-product-core.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "core-api-mgmt-aat"
      + approval_required     = true
      + display_name          = "feeRegister"
      + id                    = (known after apply)
      + product_id            = "feeRegister"
      + published             = true
      + resource_group_name   = "core-infra-aat"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

  # module.ccpay-feeregister-product-core.azurerm_api_management_product_group.access_control_groups["developers"] will be created
  + resource "azurerm_api_management_product_group" "access_control_groups" {
      + api_management_name = "core-api-mgmt-aat"
      + group_name          = "developers"
      + id                  = (known after apply)
      + product_id          = "feeRegister"
      + resource_group_name = "core-infra-aat"
    }

Plan: 5 to add, 0 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":474,"Program":"tfcmt","SHA1":"","Vars":{}} -->